app/controllers/invites_controller.rb

  def index
    @trip = Trip.find(params[:id])
    @invites = Invite.all
---
SELECT "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", "8"]]
SELECT "invites".* FROM "invites"

  def new
    @trip = Trip.find(params[:id])
---
SELECT "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", "8"]]

  def create
    user = User.find_by(email: params[:invite][:email])
    @invite = Invite.new(
      trip_id: params[:invite][:trip_id],
      email: params[:invite][:email],
      user_id: user.id
      )

    if @invite.save
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'bilbo@bilbo.com' LIMIT 1
INSERT INTO "invites" ("created_at", "email", "trip_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Mon, 31 Mar 2014 19:55:31 UTC +00:00], ["email", "bilbo@bilbo.com"], ["trip_id", 1], ["updated_at", Mon, 31 Mar 2014 19:55:31 UTC +00:00], ["user_id", 2]]

  def show
    @invite = Invite.find(params[:id])
    @trip = Trip.find(@invite.trip_id)
    @user = User.find(@invite.user_id)
    @items = Item.all
---
SELECT "invites".* FROM "invites" WHERE "invites"."id" = $1 LIMIT 1  [["id", "2"]]
SELECT "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", "2"]]
SELECT "invites".* FROM "invites" WHERE "invites"."user_id" = 2
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "2"]]
SELECT "items".* FROM "items"

  def destroy
    @invite = Invite.find(params[:id])
    @invite.destroy
---
SELECT "invites".* FROM "invites" WHERE "invites"."id" = $1 LIMIT 1  [["id", "8"]]
DELETE FROM "invites" WHERE "invites"."id" = $1  [["id", 8]]