app/controllers/items_controller.rb

SELECT "items".* FROM "items"
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", "2"]]
---
  def index
    @items = Item.all
    @current_user = User.find(session[:user_id])
    @trip = Trip.find(params[:id])

SELECT "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", "3"]]
---
  def new
    @item = Item.new
    @trip = Trip.find(params[:id])

INSERT INTO "items" ("created_at", "name", "quantity", "trip_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Sat, 29 Mar 2014 23:55:13 UTC +00:00], ["name", "bacon"], ["quantity", 1], ["trip_id", 1], ["updated_at", Sat, 29 Mar 2014 23:55:13 UTC +00:00], ["user_id", 1]]
---
  def create
    @item = Item.new(item_params)
    #have to assign user_id during create, can't pass it using require because it is not a parameter we're getting from user
    @item[:user_id] = session[:user_id]
    @item[:trip_id] = params[:trip_id].first[0].to_i

    if @item.save

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", "5"]]
SELECT "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", "16"]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @item = Item.find(params[:id])
    @trip = Trip.find(@item.trip_id)
    @user = User.find(session[:user_id])

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", "5"]]
SELECT "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", "5"]]
---
  def edit
    @item = Item.find(params[:id])
    @trip = Trip.find(@item.trip_id)

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", "5"]]
UPDATE "items" SET "is_claimed" = $1, "user_id" = $2, "updated_at" = $3 WHERE "items"."id" = 1  [["is_claimed", true], ["user_id", 1], ["updated_at", Mon, 31 Mar 2014 18:59:18 UTC +00:00]]
---
  def update
    item = Item.find(params[:id])
    item.update(item_params)

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", "5"]]
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 5]]
---
  def destroy
    item = Item.find(params[:id])
    item.destroy