app/controllers/session_controller.rb

  def create
    #find user by given email
    user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'jay.kaye31@gmail.com' LIMIT 1