app/controllers/trips_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 8]]
SELECT "trips".* FROM "trips" WHERE "trips"."user_id" IS NULL LIMIT 1
SELECT "invites".* FROM "invites" WHERE "invites"."user_id" = 3 LIMIT 1
SELECT "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def index
    #define current user in order to display trips for that user only
    @user = User.find(session[:user_id])
    @trips = Trip.where(user_id: @user.id).all
    @invite = Invite.where(user_id: params[:id]).all

    @trips = @trips.each do |trip|

INSERT INTO "trips" ("created_at", "destination", "start", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Sat, 29 Mar 2014 19:04:08 UTC +00:00], ["destination", "China"], ["start", "NY"], ["updated_at", Sat, 29 Mar 2014 19:04:08 UTC +00:00], ["user_id", 1]]
---
  def create
    @trip = Trip.new(trip_params)
    #have to assign user_id during create, can't pass it using require because it is not a parameter we're getting from user
    @trip[:user_id] = session[:user_id]

    if @trip.save

SELECT "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def edit
    @trip = Trip.find(params[:id])

SELECT "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "trips" SET "destination" = $1, "updated_at" = $2 WHERE "trips"."id" = 1  [["destination", "Florida"], ["updated_at", Sat, 29 Mar 2014 19:16:34 UTC +00:00]]
---
  def update
    trip = Trip.find(params[:id])
    trip.update(trip_params)

SELECT "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "trips" WHERE "trips"."id" = $1  [["id", 1]]
---
  def destroy
    trip = Trip.find(params[:id])
    trip.destroy