app/controllers/tweet_controller.rb

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def index
    tweet_item = Item.find(params[:id])