app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    user = User.find(params[:id])
    user.update(
      name: params[:user][:name],
      email: params[:user][:email]
      )
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "2"]]
UPDATE "users" SET "name" = $1, "email" = $2, "password_digest" = $3, "updated_at" = $4 WHERE "users"."id" = 2  [["name", "Frodo"], ["email", "frodo@frodo.com"], ["password_digest", "$2a$10$.GObgIxnD6VjoJ/Eco3vj.zWCqJtomGiwExJ9rVae7Pk9Ym1Wo70G"], ["updated_at", Fri, 28 Mar 2014 22:19:56 UTC +00:00]]